package cTr.knowledgeMaraphone.PFC;

import cTr.knowledgeMaraphone.ProteinsFatCarbohydrates;

public class Fats implements ProteinsFatCarbohydrates {
    private String name;

    public Fats(String name) {

        this.name = name;
    }

    @Override
    public void countPFC() {
        System.out.println("here " + name);
/*        Жиры – необходимый компонент питания, поскольку они отвечают за регенерацию кожи,
усвоение жирорастворимых витаминов, синтез гормонов, защиту внутренних органов. А ещё они помогают
 контролировать аппетит.
        Жиры бывают насыщенные и ненасыщенные. Насыщенные жиры находятся в мясе, птице, молочных продуктах,
         сыре, сливочном, кокосовом и пальмовым маслом.
                Источники ненасыщенных жиров – большинство растительных масел, рыба, орехи, семена.
                Самый вредный и опасный вид жира – это трансжиры (маргарин), содержащийся в большинстве
                кондитерских изделий.
        Особенную важность представляют Омега-3 жирные кислоты. Они находятся в рыбе, добавках рыбьего
         жира, льняном масле. Омега-3 снижают уровень холестерина, улучшают кровоснабжение мозга и клеток.
        Потребности следующие:
 • При сильно избыточном весе – 0,4-0,6 г на каждый килограмм массы тела;
 • При избыточном весе – 0,7-0,8 г на каждый килограмм массы тела;
 • При нормальном весе – 0,9-1,1 г на каждый килограмм массы тела.*/
        double fat = 89.0;
    }
}
